{
  "profileSummary": {
    "description": [
      "I have a passion for learning and problem solving and I enjoy developing my skills in new technologies and methods. Since joining Capgemini Engineering, I have gained project experience of full stack software development and worked in multiple project teams. My work has included creating automated CI/CD pipelines for Python applications. I have also worked on databases and the APIs being consumed by these applications. Additionally, I have developed User Interfaces using different frameworks to create web, desktop, and mobile applications. This has involved learning to use a wide range of technologies, as well as the Agile methodologies used for these projects.",
      "Prior to starting at Capgemini Engineering, I studied Physics at the University of Birmingham and during this time, I worked on multiple scientific computing projects in Python. These involved developing and training convolutional neural networks, image processing, 2D simulations, and data analysis in a scientific context. Additionally, I developed my capacity for quick learning, writing technical reports, delivering presentations, and working effectively within a team.",
      "In my free time, I enjoy exploring technical topics such as reinforcement learning algorithms with artificial neural networks to train AI to drive simulated cars through obstacles. I have also created genetic algorithms which can solve alphanumeric phrases by using random guesses and employing ideas from natural selection and biological evolution. I also enjoy learning music theory, composing in digital audio workstations, and playing piano and guitar."
    ]
  },
  "technologies": [
    {
      "name": "Python",
      "url": "https://www.python.org/"
    },
    {
      "name": "React",
      "url": "https://reactjs.org/"
    },
    {
      "name": "TypeScript",
      "url": "https://www.typescriptlang.org/"
    },
    {
      "name": "Electron",
      "url": "https://www.electronjs.org/"
    },
    {
      "name": "Flutter",
      "url": "https://flutter.dev/"
    },
    {
      "name": "Dart",
      "url": "https://dart.dev/"
    },
    {
      "name": "C#",
      "url": "https://docs.microsoft.com/en-us/dotnet/csharp/"
    },
    {
      "name": "Unity",
      "url": "https://unity.com/"
    },
    {
      "name": "Protobuf",
      "url": "https://protobuf.dev/"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/"
    },
    {
      "name": "Gitlab",
      "url": "https://gitlab.com/"
    },
    {
      "name": "DevOps",
      "url": "https://azure.microsoft.com/en-us/products/devops/"
    }
  ]
}
